from fastapi import FastAPI
from pydantic import BaseModel

app = FastAPI()
class Item(BaseModel):
    studentnumber:int
    name : str
    pass_num: str
    year: str
    city: str
    prov: str
    add: str
    post: str
    pnumb: str
    hnumb: str
    danesh: str
    fos: str
    mstate: str
    meli: str

#1----------------------------------------------------------------------------------------------------------------------
@app.post("/college/")
async def sys(inp:Item):
    response = {}
    a1_1 = 0
    a2_1 = 0
    a3_1 = 0
    a4_1 = 0
    resp1 = []
    snum = str(inp.studentnumber)
    if 400 <= int(snum[0:3]) <= 402:
        resp1.append("yippee")
    else:
        resp1.append("شماره سال نادرست")
        a1_1 = 1
    le = int(len(snum))
    if le != 11:
        resp1.append("شماره دانشجویی باید11رقم باشد.تعداد ارقام شماره دانشجویی وارد شده نادرست است")
        a2_1 = 1
    if int(snum[3:9]) != 114150:
        resp1.append("قسمت ثابت نادرست است.")
        a3_1 = 1
    if 1 <= int(snum[9:11]) <= 99:
        a4_1 += 0
    else:
        resp1.append("قسمت اندیس نادرست است. ")
        a4_1 = 1
    if a1_1 == 0 and a2_1 == 0 and a3_1 == 0 and a4_1 == 0:
        resp1.append(f"شماره دانشجویی وارد شده درست است. ")
    response['response_1'] = resp1

#2----------------------------------------------------------------------------------------------------------------------

    a1_2=0;a2_2=0;a3_2=0
    count2 = 0
    resp2=[]
    le2 = int(len(inp.name))
    len2 = len(inp.name)
    if le2 >10:
        resp2.append("نام از ده کارکتر طولانی تر است.")
        a1_2=1
    for i in inp.name:
        if i >= 'a' and i <= 'z':
            count += 1
        if i >= 'A' and i<= 'Z':
            count += 1
    if count2 > 0:
        resp2.append("اسم خود را به فارسی وارد کنید.")
        a2_2=1
    if inp.name.isalpha() == False:
        resp2.append("کارکتر های ورودی باید حروف باشند.")
        a3_2=1
    if a1_2==0 and a2_2==0 and a3_2 == 0:
        resp2.append("نام ثبت شد.")

    response['response_2'] = resp2
#3----------------------------------------------------------------------------------------------------------------------
    resp3 = []
    if int(inp.year[5:7]) > 12 or int(inp.year[8:]) > 31:
        resp3.append("قالب ورودی اشتباه.")
    else:
        resp3.append("تاریخ تولد ثبت شد.")
    response['response_3'] = resp3
#4----------------------------------------------------------------------------------------------------------------------
    cou4 = 0
    resp4 = []
    p1_4 = inp.pass_num[0:1]
    p2_4 = inp.pass_num[1:7]
    p3_4 = inp.pass_num[8:]

    if p2_4.isdigit() == False:
        cou4 += 1
    if p1_4 == int:
        cou4 += 1
    if p3_4.isdigit() == False:
        cou4 += 1
    if cou4 != 0:
        resp4.append("قالب ورودی اشتباه است.")
    if cou4 == 0:
        resp4.append("شماره شناسنامه ثبت شد.")
    response['response_4']=resp4
#6----------------------------------------------------------------------------------------------------------------------
    resp6 = []
    list6 = ["اراک" ,'اردبیل', "تبریز", 'اصفهان' , "اهواز" , 'ایلام' , "بجنورد" , 'بندرعباس' , "بوشهر" , "بیرجند" ,
            "ارومیه" , "تهران" , "خرم آباد" , "رشت" , "زاهدان" , "زنجان" , "ساری" , "سمنان" , "سنندج","شهرکرد" ,"شیراز",
            "قزوین" "قم" , "کرج" , "کرمان" , "کرمانشاه" , "گرگان" , "مشهد" , "همدان" , "یاسوج" , "یزد", ]
    if inp.city  not in list6:
        resp6.append("شهر تولد باید از یکی مراکز استان باشد.")
    else:
        resp6.append("شهر تولد ثبت شد.")
    response['response_6'] = resp6
#5----------------------------------------------------------------------------------------------------------------------
    resp5 = []
    list5 = ["مرکزی", 'اردبیل', "آذربایجان شرقی", 'اصفهان', "خوزستان", 'ایلام', "خراسان شمالی", 'هرمزگان', "بوشهر",
            "خراسان جنوبی","آذربایجان غربی","تهران","لرستان","گیلان","سیستان و بلوچستان",
            "زنجان","مازندران","سمنان","کردستان","چهارمهال بختیاری","فارس","قزوین","قم","البرز","کرمان",
            "کرمانشاه","گلستان","خراسان رضوی","همدان","کهگیلویه و بویراحمد ","یزد"]
    if inp.prov  not in list5:
        resp5.append("استان تولد بایداز استان های کشور باشد.")
    else:
        resp5.append("استان تولد شما ثبت شد.")
    response['response_5'] = resp5
#7----------------------------------------------------------------------------------------------------------------------
    resp7 = []
    le7 = int(len(inp.add))
    if le7 > 100:
        resp7.append("آدرس نباید بیشتر از 100 کازاکتر باشد.")
    else:
        resp7.append("آدرس شما ثبت شد.")
    response['response_7'] = resp7
#8----------------------------------------------------------------------------------------------------------------------
    resp8 = []
    le8 = int(len(inp.post))

    if inp.post != int and le8 != 10:
        resp8.append('کد پستی صحیح نمیباشد.')
    else:
        resp8.append("کد پستی صحیح میباشد")
    response['response_8'] = resp8
#9----------------------------------------------------------------------------------------------------------------------
    resp9= []
    le9 = int(len(inp.pnumb))
    if inp.pnumb[0:2] != '09' or le != 11 :
        resp9.append("شماره وارد شده صحیح نمیباشید.")
    else:
        resp9.append("شماره وارد شده صحیح میباشد.")

    response['response_9'] = resp9
#10---------------------------------------------------------------------------------------------------------------------
    cou10 = 0
    le10 = int(len(inp.hnumb))
    resp10 = []
    list10 = ["041", '044', "045", '031', "026", '084', "077", '021', "038" , "056",
             "051", "058", "061", "024", "023", "054", "071", "028", "025", "087", "034", "083",
             "074", "017", "013", "066", "011", "086", "076", "081", "035"]
    list10_2 = ["3", '4', '5', '8']
    if inp.hnumb[0:3] not in list10 or inp.hnumb[3] not in list10_2:
        cou10 += 1
    if le10 != 11:
        cou10 += 1
    if cou10==0:
        resp10.append('شماره وارد شده صحیح است.')
    if cou10 !=0:
        resp10.append('شماره وارد شده صحیح نیست.')
    response['response_10'] = resp10
#11---------------------------------------------------------------------------------------------------------------------
    resp11 = []
    list11= [ "فنی و مهندسی" ,'علوم پایه','علوم انسانی','دامپزشکی','اقتصاد','کشاورزی','منابع طبیعی']
    if inp.danesh not in list11:
        resp11.append('دانشکده غیر مجاز است.')

    else:
        resp11.append('دانشکده انتخاب شد.')
    response['response_11'] = resp11
#12---------------------------------------------------------------------------------------------------------------------
    resp12=[]
    foslist = ["مهندسی عمران","مهندسی مکانیک","مهندسی برق","مهندسی صنایع",
    "مهندسی شیمی","مهندسی مواد","مهندسی پزشکی","مهندسی هوافضا","مهندسی کامپیوتر","مهندسی مخازن نفت",
    "مهندسی معدن","مهندسی زلزله‌شناسی","مهندسی محیط‌زیست","مهندسی هیدرولیک","مهندسی مکاترونیک","مهندسی هسته‌ای",
    "مهندسی خودرو","مهندسی رباتیک",]
    if inp.fos  in foslist:
        resp12.append('رشته مورد نظر انتخاب شد.')
    else:
        resp12.append('رشته مورد نظر وجود ندارد.')
    response['response_12'] = resp12
#13---------------------------------------------------------------------------------------------------------------------
    resp13 = []
    list13 = ["مجرد" , 'متاهل']
    if inp.mstate in list13:
        resp13.append('وضعیت تاهل ثبت شد.')
    else:
        resp13.append('وضعیت ورودی معتبر نیست.')
    response['response_13'] = resp13
#14---------------------------------------------------------------------------------------------------------------------
    resp14 = []
    l14 = int(len(inp.meli))
    sum14 = 0
    for i in range(0, l14 - 1):
        c = ord(inp.meli[i])
        c -= 48
        sum14 = sum14 + c * (l14 - i)
    r = sum14 % 11
    c = ord(inp.meli[l14 - 1])
    c -= 48
    if r > 2:
        r = 11 - r
    if r == c:
        resp14.append("کد ثبت شد.")
    else:
        resp14.append("کد معتبر نیست.")
    response['response_14'] =resp14
    return response
